{"data":{"site":{"siteMetadata":{"title":"Blog by Raymond Luong","subtitle":"Software Engineer in San Francisco","menu":[{"label":"Blog","path":"/"},{"label":"About me","path":"/about/"}],"author":{"name":"Raymond Luong","instagram":"instaraymond","twitter":"luongraymond","github":"raymondluong"}}},"markdownRemark":{"id":"9ffd2ee2-b373-5f3b-ae9a-49ce88bcd56a","html":"<p>Hello! I’m a software engineer who enjoys front-end development and UI/UX design.</p>\n<p>A few tools in my toolkit: JavaScript (ES6), React, Redux, Flow, Gatsby, Ruby on Rails, HTML5, CSS3, Git, VSCode, and Sketch. Currently working on TypeScript and Webpack.</p>\n<p>Preferred pronouns: he/him/his.</p>\n<h3>Current Role</h3>\n<p>I’m an engineer on the <a href=\"https://gusto.com/product/benefits\" target=\"_blank\">Benefits team at Gusto</a>. Our mission is to build a world class experience to help small businesses offer over 11 different types of benefits to their employees. Everyday we’re dreaming of ways to level up our benefits offering by making it more affordable, accessible, guided, personalized, and seamless. We make this a reality by building automation for our operation teams, building recommendation systems for our customers, deeply integrating with partners, supporting new regulations aimed at helping small business, and much much more.</p>\n<p>Outside of work, I love exploring the </p>\n<h3>Origin Story</h3>\n<p>I first discovered programming when I was 10 years old. How? Virtual pets.\nI was <em>obsessed</em> with this website called Neopets where you can adopt virtual\npets and buy virtual items for them. Part of the fun included building your pet its own website.\nThrough a lot of trial and error (and blindly copying and pasting code I googled),\nI stitched a simple website for my virtual dog.</p>\n<p>It’s been a fun journey since then. I took my first programming course freshman year at college\nand decided I hated programming and would never do it again. Two years later, I realized I\nmade a huge mistake. I ended up taking the next programming course in the sequence and fell in love. Learning about hash maps and recursion absolutely blew my mind.</p>\n<p>I wanted more. I took a wide variety of classes — systems, security, databases, and algorithms.\nMy favorite discipline ended up being human-computer interaction. I love how it combines computer science, psychology, and design to study how humans use technology.</p>","frontmatter":{"title":"About me","date":null,"description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/about"}}